; domain
(define (domain transport-strips)
(:requirements :typing :action-costs)

(:types location fuellevel locatable - object 
	package truck - locatable
)

(:predicates 
(connected ?l1 ?l2 - location)
(at ?o - locatable ?l - location)
(in ?p - package ?t - truck)
(fuel ?t - truck ?level - fuellevel)
(fuelcost ?level - fuellevel ?l1 ?l2 - location)
(sum ?a ?b ?c - fuellevel)
)

(:functions 
(total-cost) - number)

(:action LOAD
:parameters
(?p - package
?t - truck
?l - location)
:precondition
(and (at ?t ?l) (at ?p ?l))
:effect
(and (not (at ?p ?l)) (in ?p ?t) (increase (total-cost) 1))
)

(:action UNLOAD
:parameters
(?p - package
?t - truck
?l - location)
:precondition
(and (at ?t ?l) (in ?p ?t))
:effect
(and (at ?p ?l) (not (in ?p ?t)) (increase (total-cost) 1))
)

(:action DRIVE
:parameters
(?t - truck
?l1 - location
?l2 - location
?fuelpost - fuellevel
?fueldelta - fuellevel
?fuelpre - fuellevel)
:precondition
(and 
(connected ?l1 ?l2)
(fuelcost ?fueldelta ?l1 ?l2)
(fuel ?t ?fuelpre)
(sum ?fuelpost ?fueldelta ?fuelpre)
(at ?t ?l1)
)
:effect
(and (not (at ?t ?l1)) 
     (at ?t ?l2) 
     (not (fuel ?t ?fuelpre)) 
     (fuel ?t ?fuelpost)
     (increase (total-cost) 1))
)

)

; problem
(define (problem transport-l8-t1-p4---int100n150-m25---int100c110---s87---e0)
(:domain transport-strips)

(:objects
l0 l1 l2 l3 l4 l5 l6 l7 - location
t0 - truck
p0 p1 p2 p3 - package
level0 level1 level2 level3 level4 level5 level6 level7 level8 level9 level10 level11 level12 level13 level14 level15 level16 level17 level18 level19 level20 level21 level22 level23 level24 level25 level26 level27 level28 level29 level30 level31 level32 level33 level34 level35 level36 level37 level38 level39 level40 level41 level42 level43 level44 level45 level46 level47 level48 level49 level50 level51 level52 level53 level54 level55 level56 level57 level58 level59 level60 level61 level62 level63 level64 level65 level66 level67 level68 level69 level70 level71 level72 level73 - fuellevel
)

(:init
(sum level0 level2 level2)
(sum level0 level3 level3)
(sum level0 level5 level5)
(sum level0 level6 level6)
(sum level0 level8 level8)
(sum level0 level9 level9)
(sum level0 level12 level12)
(sum level0 level18 level18)
(sum level0 level19 level19)
(sum level0 level20 level20)
(sum level1 level2 level3)
(sum level1 level3 level4)
(sum level1 level5 level6)
(sum level1 level6 level7)
(sum level1 level8 level9)
(sum level1 level9 level10)
(sum level1 level12 level13)
(sum level1 level18 level19)
(sum level1 level19 level20)
(sum level1 level20 level21)
(sum level2 level2 level4)
(sum level2 level3 level5)
(sum level2 level5 level7)
(sum level2 level6 level8)
(sum level2 level8 level10)
(sum level2 level9 level11)
(sum level2 level12 level14)
(sum level2 level18 level20)
(sum level2 level19 level21)
(sum level2 level20 level22)
(sum level3 level2 level5)
(sum level3 level3 level6)
(sum level3 level5 level8)
(sum level3 level6 level9)
(sum level3 level8 level11)
(sum level3 level9 level12)
(sum level3 level12 level15)
(sum level3 level18 level21)
(sum level3 level19 level22)
(sum level3 level20 level23)
(sum level4 level2 level6)
(sum level4 level3 level7)
(sum level4 level5 level9)
(sum level4 level6 level10)
(sum level4 level8 level12)
(sum level4 level9 level13)
(sum level4 level12 level16)
(sum level4 level18 level22)
(sum level4 level19 level23)
(sum level4 level20 level24)
(sum level5 level2 level7)
(sum level5 level3 level8)
(sum level5 level5 level10)
(sum level5 level6 level11)
(sum level5 level8 level13)
(sum level5 level9 level14)
(sum level5 level12 level17)
(sum level5 level18 level23)
(sum level5 level19 level24)
(sum level5 level20 level25)
(sum level6 level2 level8)
(sum level6 level3 level9)
(sum level6 level5 level11)
(sum level6 level6 level12)
(sum level6 level8 level14)
(sum level6 level9 level15)
(sum level6 level12 level18)
(sum level6 level18 level24)
(sum level6 level19 level25)
(sum level6 level20 level26)
(sum level7 level2 level9)
(sum level7 level3 level10)
(sum level7 level5 level12)
(sum level7 level6 level13)
(sum level7 level8 level15)
(sum level7 level9 level16)
(sum level7 level12 level19)
(sum level7 level18 level25)
(sum level7 level19 level26)
(sum level7 level20 level27)
(sum level8 level2 level10)
(sum level8 level3 level11)
(sum level8 level5 level13)
(sum level8 level6 level14)
(sum level8 level8 level16)
(sum level8 level9 level17)
(sum level8 level12 level20)
(sum level8 level18 level26)
(sum level8 level19 level27)
(sum level8 level20 level28)
(sum level9 level2 level11)
(sum level9 level3 level12)
(sum level9 level5 level14)
(sum level9 level6 level15)
(sum level9 level8 level17)
(sum level9 level9 level18)
(sum level9 level12 level21)
(sum level9 level18 level27)
(sum level9 level19 level28)
(sum level9 level20 level29)
(sum level10 level2 level12)
(sum level10 level3 level13)
(sum level10 level5 level15)
(sum level10 level6 level16)
(sum level10 level8 level18)
(sum level10 level9 level19)
(sum level10 level12 level22)
(sum level10 level18 level28)
(sum level10 level19 level29)
(sum level10 level20 level30)
(sum level11 level2 level13)
(sum level11 level3 level14)
(sum level11 level5 level16)
(sum level11 level6 level17)
(sum level11 level8 level19)
(sum level11 level9 level20)
(sum level11 level12 level23)
(sum level11 level18 level29)
(sum level11 level19 level30)
(sum level11 level20 level31)
(sum level12 level2 level14)
(sum level12 level3 level15)
(sum level12 level5 level17)
(sum level12 level6 level18)
(sum level12 level8 level20)
(sum level12 level9 level21)
(sum level12 level12 level24)
(sum level12 level18 level30)
(sum level12 level19 level31)
(sum level12 level20 level32)
(sum level13 level2 level15)
(sum level13 level3 level16)
(sum level13 level5 level18)
(sum level13 level6 level19)
(sum level13 level8 level21)
(sum level13 level9 level22)
(sum level13 level12 level25)
(sum level13 level18 level31)
(sum level13 level19 level32)
(sum level13 level20 level33)
(sum level14 level2 level16)
(sum level14 level3 level17)
(sum level14 level5 level19)
(sum level14 level6 level20)
(sum level14 level8 level22)
(sum level14 level9 level23)
(sum level14 level12 level26)
(sum level14 level18 level32)
(sum level14 level19 level33)
(sum level14 level20 level34)
(sum level15 level2 level17)
(sum level15 level3 level18)
(sum level15 level5 level20)
(sum level15 level6 level21)
(sum level15 level8 level23)
(sum level15 level9 level24)
(sum level15 level12 level27)
(sum level15 level18 level33)
(sum level15 level19 level34)
(sum level15 level20 level35)
(sum level16 level2 level18)
(sum level16 level3 level19)
(sum level16 level5 level21)
(sum level16 level6 level22)
(sum level16 level8 level24)
(sum level16 level9 level25)
(sum level16 level12 level28)
(sum level16 level18 level34)
(sum level16 level19 level35)
(sum level16 level20 level36)
(sum level17 level2 level19)
(sum level17 level3 level20)
(sum level17 level5 level22)
(sum level17 level6 level23)
(sum level17 level8 level25)
(sum level17 level9 level26)
(sum level17 level12 level29)
(sum level17 level18 level35)
(sum level17 level19 level36)
(sum level17 level20 level37)
(sum level18 level2 level20)
(sum level18 level3 level21)
(sum level18 level5 level23)
(sum level18 level6 level24)
(sum level18 level8 level26)
(sum level18 level9 level27)
(sum level18 level12 level30)
(sum level18 level18 level36)
(sum level18 level19 level37)
(sum level18 level20 level38)
(sum level19 level2 level21)
(sum level19 level3 level22)
(sum level19 level5 level24)
(sum level19 level6 level25)
(sum level19 level8 level27)
(sum level19 level9 level28)
(sum level19 level12 level31)
(sum level19 level18 level37)
(sum level19 level19 level38)
(sum level19 level20 level39)
(sum level20 level2 level22)
(sum level20 level3 level23)
(sum level20 level5 level25)
(sum level20 level6 level26)
(sum level20 level8 level28)
(sum level20 level9 level29)
(sum level20 level12 level32)
(sum level20 level18 level38)
(sum level20 level19 level39)
(sum level20 level20 level40)
(sum level21 level2 level23)
(sum level21 level3 level24)
(sum level21 level5 level26)
(sum level21 level6 level27)
(sum level21 level8 level29)
(sum level21 level9 level30)
(sum level21 level12 level33)
(sum level21 level18 level39)
(sum level21 level19 level40)
(sum level21 level20 level41)
(sum level22 level2 level24)
(sum level22 level3 level25)
(sum level22 level5 level27)
(sum level22 level6 level28)
(sum level22 level8 level30)
(sum level22 level9 level31)
(sum level22 level12 level34)
(sum level22 level18 level40)
(sum level22 level19 level41)
(sum level22 level20 level42)
(sum level23 level2 level25)
(sum level23 level3 level26)
(sum level23 level5 level28)
(sum level23 level6 level29)
(sum level23 level8 level31)
(sum level23 level9 level32)
(sum level23 level12 level35)
(sum level23 level18 level41)
(sum level23 level19 level42)
(sum level23 level20 level43)
(sum level24 level2 level26)
(sum level24 level3 level27)
(sum level24 level5 level29)
(sum level24 level6 level30)
(sum level24 level8 level32)
(sum level24 level9 level33)
(sum level24 level12 level36)
(sum level24 level18 level42)
(sum level24 level19 level43)
(sum level24 level20 level44)
(sum level25 level2 level27)
(sum level25 level3 level28)
(sum level25 level5 level30)
(sum level25 level6 level31)
(sum level25 level8 level33)
(sum level25 level9 level34)
(sum level25 level12 level37)
(sum level25 level18 level43)
(sum level25 level19 level44)
(sum level25 level20 level45)
(sum level26 level2 level28)
(sum level26 level3 level29)
(sum level26 level5 level31)
(sum level26 level6 level32)
(sum level26 level8 level34)
(sum level26 level9 level35)
(sum level26 level12 level38)
(sum level26 level18 level44)
(sum level26 level19 level45)
(sum level26 level20 level46)
(sum level27 level2 level29)
(sum level27 level3 level30)
(sum level27 level5 level32)
(sum level27 level6 level33)
(sum level27 level8 level35)
(sum level27 level9 level36)
(sum level27 level12 level39)
(sum level27 level18 level45)
(sum level27 level19 level46)
(sum level27 level20 level47)
(sum level28 level2 level30)
(sum level28 level3 level31)
(sum level28 level5 level33)
(sum level28 level6 level34)
(sum level28 level8 level36)
(sum level28 level9 level37)
(sum level28 level12 level40)
(sum level28 level18 level46)
(sum level28 level19 level47)
(sum level28 level20 level48)
(sum level29 level2 level31)
(sum level29 level3 level32)
(sum level29 level5 level34)
(sum level29 level6 level35)
(sum level29 level8 level37)
(sum level29 level9 level38)
(sum level29 level12 level41)
(sum level29 level18 level47)
(sum level29 level19 level48)
(sum level29 level20 level49)
(sum level30 level2 level32)
(sum level30 level3 level33)
(sum level30 level5 level35)
(sum level30 level6 level36)
(sum level30 level8 level38)
(sum level30 level9 level39)
(sum level30 level12 level42)
(sum level30 level18 level48)
(sum level30 level19 level49)
(sum level30 level20 level50)
(sum level31 level2 level33)
(sum level31 level3 level34)
(sum level31 level5 level36)
(sum level31 level6 level37)
(sum level31 level8 level39)
(sum level31 level9 level40)
(sum level31 level12 level43)
(sum level31 level18 level49)
(sum level31 level19 level50)
(sum level31 level20 level51)
(sum level32 level2 level34)
(sum level32 level3 level35)
(sum level32 level5 level37)
(sum level32 level6 level38)
(sum level32 level8 level40)
(sum level32 level9 level41)
(sum level32 level12 level44)
(sum level32 level18 level50)
(sum level32 level19 level51)
(sum level32 level20 level52)
(sum level33 level2 level35)
(sum level33 level3 level36)
(sum level33 level5 level38)
(sum level33 level6 level39)
(sum level33 level8 level41)
(sum level33 level9 level42)
(sum level33 level12 level45)
(sum level33 level18 level51)
(sum level33 level19 level52)
(sum level33 level20 level53)
(sum level34 level2 level36)
(sum level34 level3 level37)
(sum level34 level5 level39)
(sum level34 level6 level40)
(sum level34 level8 level42)
(sum level34 level9 level43)
(sum level34 level12 level46)
(sum level34 level18 level52)
(sum level34 level19 level53)
(sum level34 level20 level54)
(sum level35 level2 level37)
(sum level35 level3 level38)
(sum level35 level5 level40)
(sum level35 level6 level41)
(sum level35 level8 level43)
(sum level35 level9 level44)
(sum level35 level12 level47)
(sum level35 level18 level53)
(sum level35 level19 level54)
(sum level35 level20 level55)
(sum level36 level2 level38)
(sum level36 level3 level39)
(sum level36 level5 level41)
(sum level36 level6 level42)
(sum level36 level8 level44)
(sum level36 level9 level45)
(sum level36 level12 level48)
(sum level36 level18 level54)
(sum level36 level19 level55)
(sum level36 level20 level56)
(sum level37 level2 level39)
(sum level37 level3 level40)
(sum level37 level5 level42)
(sum level37 level6 level43)
(sum level37 level8 level45)
(sum level37 level9 level46)
(sum level37 level12 level49)
(sum level37 level18 level55)
(sum level37 level19 level56)
(sum level37 level20 level57)
(sum level38 level2 level40)
(sum level38 level3 level41)
(sum level38 level5 level43)
(sum level38 level6 level44)
(sum level38 level8 level46)
(sum level38 level9 level47)
(sum level38 level12 level50)
(sum level38 level18 level56)
(sum level38 level19 level57)
(sum level38 level20 level58)
(sum level39 level2 level41)
(sum level39 level3 level42)
(sum level39 level5 level44)
(sum level39 level6 level45)
(sum level39 level8 level47)
(sum level39 level9 level48)
(sum level39 level12 level51)
(sum level39 level18 level57)
(sum level39 level19 level58)
(sum level39 level20 level59)
(sum level40 level2 level42)
(sum level40 level3 level43)
(sum level40 level5 level45)
(sum level40 level6 level46)
(sum level40 level8 level48)
(sum level40 level9 level49)
(sum level40 level12 level52)
(sum level40 level18 level58)
(sum level40 level19 level59)
(sum level40 level20 level60)
(sum level41 level2 level43)
(sum level41 level3 level44)
(sum level41 level5 level46)
(sum level41 level6 level47)
(sum level41 level8 level49)
(sum level41 level9 level50)
(sum level41 level12 level53)
(sum level41 level18 level59)
(sum level41 level19 level60)
(sum level41 level20 level61)
(sum level42 level2 level44)
(sum level42 level3 level45)
(sum level42 level5 level47)
(sum level42 level6 level48)
(sum level42 level8 level50)
(sum level42 level9 level51)
(sum level42 level12 level54)
(sum level42 level18 level60)
(sum level42 level19 level61)
(sum level42 level20 level62)
(sum level43 level2 level45)
(sum level43 level3 level46)
(sum level43 level5 level48)
(sum level43 level6 level49)
(sum level43 level8 level51)
(sum level43 level9 level52)
(sum level43 level12 level55)
(sum level43 level18 level61)
(sum level43 level19 level62)
(sum level43 level20 level63)
(sum level44 level2 level46)
(sum level44 level3 level47)
(sum level44 level5 level49)
(sum level44 level6 level50)
(sum level44 level8 level52)
(sum level44 level9 level53)
(sum level44 level12 level56)
(sum level44 level18 level62)
(sum level44 level19 level63)
(sum level44 level20 level64)
(sum level45 level2 level47)
(sum level45 level3 level48)
(sum level45 level5 level50)
(sum level45 level6 level51)
(sum level45 level8 level53)
(sum level45 level9 level54)
(sum level45 level12 level57)
(sum level45 level18 level63)
(sum level45 level19 level64)
(sum level45 level20 level65)
(sum level46 level2 level48)
(sum level46 level3 level49)
(sum level46 level5 level51)
(sum level46 level6 level52)
(sum level46 level8 level54)
(sum level46 level9 level55)
(sum level46 level12 level58)
(sum level46 level18 level64)
(sum level46 level19 level65)
(sum level46 level20 level66)
(sum level47 level2 level49)
(sum level47 level3 level50)
(sum level47 level5 level52)
(sum level47 level6 level53)
(sum level47 level8 level55)
(sum level47 level9 level56)
(sum level47 level12 level59)
(sum level47 level18 level65)
(sum level47 level19 level66)
(sum level47 level20 level67)
(sum level48 level2 level50)
(sum level48 level3 level51)
(sum level48 level5 level53)
(sum level48 level6 level54)
(sum level48 level8 level56)
(sum level48 level9 level57)
(sum level48 level12 level60)
(sum level48 level18 level66)
(sum level48 level19 level67)
(sum level48 level20 level68)
(sum level49 level2 level51)
(sum level49 level3 level52)
(sum level49 level5 level54)
(sum level49 level6 level55)
(sum level49 level8 level57)
(sum level49 level9 level58)
(sum level49 level12 level61)
(sum level49 level18 level67)
(sum level49 level19 level68)
(sum level49 level20 level69)
(sum level50 level2 level52)
(sum level50 level3 level53)
(sum level50 level5 level55)
(sum level50 level6 level56)
(sum level50 level8 level58)
(sum level50 level9 level59)
(sum level50 level12 level62)
(sum level50 level18 level68)
(sum level50 level19 level69)
(sum level50 level20 level70)
(sum level51 level2 level53)
(sum level51 level3 level54)
(sum level51 level5 level56)
(sum level51 level6 level57)
(sum level51 level8 level59)
(sum level51 level9 level60)
(sum level51 level12 level63)
(sum level51 level18 level69)
(sum level51 level19 level70)
(sum level51 level20 level71)
(sum level52 level2 level54)
(sum level52 level3 level55)
(sum level52 level5 level57)
(sum level52 level6 level58)
(sum level52 level8 level60)
(sum level52 level9 level61)
(sum level52 level12 level64)
(sum level52 level18 level70)
(sum level52 level19 level71)
(sum level52 level20 level72)
(sum level53 level2 level55)
(sum level53 level3 level56)
(sum level53 level5 level58)
(sum level53 level6 level59)
(sum level53 level8 level61)
(sum level53 level9 level62)
(sum level53 level12 level65)
(sum level53 level18 level71)
(sum level53 level19 level72)
(sum level53 level20 level73)
(sum level54 level2 level56)
(sum level54 level3 level57)
(sum level54 level5 level59)
(sum level54 level6 level60)
(sum level54 level8 level62)
(sum level54 level9 level63)
(sum level54 level12 level66)
(sum level54 level18 level72)
(sum level54 level19 level73)
(sum level55 level2 level57)
(sum level55 level3 level58)
(sum level55 level5 level60)
(sum level55 level6 level61)
(sum level55 level8 level63)
(sum level55 level9 level64)
(sum level55 level12 level67)
(sum level55 level18 level73)
(sum level56 level2 level58)
(sum level56 level3 level59)
(sum level56 level5 level61)
(sum level56 level6 level62)
(sum level56 level8 level64)
(sum level56 level9 level65)
(sum level56 level12 level68)
(sum level57 level2 level59)
(sum level57 level3 level60)
(sum level57 level5 level62)
(sum level57 level6 level63)
(sum level57 level8 level65)
(sum level57 level9 level66)
(sum level57 level12 level69)
(sum level58 level2 level60)
(sum level58 level3 level61)
(sum level58 level5 level63)
(sum level58 level6 level64)
(sum level58 level8 level66)
(sum level58 level9 level67)
(sum level58 level12 level70)
(sum level59 level2 level61)
(sum level59 level3 level62)
(sum level59 level5 level64)
(sum level59 level6 level65)
(sum level59 level8 level67)
(sum level59 level9 level68)
(sum level59 level12 level71)
(sum level60 level2 level62)
(sum level60 level3 level63)
(sum level60 level5 level65)
(sum level60 level6 level66)
(sum level60 level8 level68)
(sum level60 level9 level69)
(sum level60 level12 level72)
(sum level61 level2 level63)
(sum level61 level3 level64)
(sum level61 level5 level66)
(sum level61 level6 level67)
(sum level61 level8 level69)
(sum level61 level9 level70)
(sum level61 level12 level73)
(sum level62 level2 level64)
(sum level62 level3 level65)
(sum level62 level5 level67)
(sum level62 level6 level68)
(sum level62 level8 level70)
(sum level62 level9 level71)
(sum level63 level2 level65)
(sum level63 level3 level66)
(sum level63 level5 level68)
(sum level63 level6 level69)
(sum level63 level8 level71)
(sum level63 level9 level72)
(sum level64 level2 level66)
(sum level64 level3 level67)
(sum level64 level5 level69)
(sum level64 level6 level70)
(sum level64 level8 level72)
(sum level64 level9 level73)
(sum level65 level2 level67)
(sum level65 level3 level68)
(sum level65 level5 level70)
(sum level65 level6 level71)
(sum level65 level8 level73)
(sum level66 level2 level68)
(sum level66 level3 level69)
(sum level66 level5 level71)
(sum level66 level6 level72)
(sum level67 level2 level69)
(sum level67 level3 level70)
(sum level67 level5 level72)
(sum level67 level6 level73)
(sum level68 level2 level70)
(sum level68 level3 level71)
(sum level68 level5 level73)
(sum level69 level2 level71)
(sum level69 level3 level72)
(sum level70 level2 level72)
(sum level70 level3 level73)
(sum level71 level2 level73)

(connected l0 l5)
(fuelcost level20 l0 l5)
(connected l0 l7)
(fuelcost level2 l0 l7)
(connected l1 l2)
(fuelcost level18 l1 l2)
(connected l1 l4)
(fuelcost level5 l1 l4)
(connected l1 l5)
(fuelcost level3 l1 l5)
(connected l2 l1)
(fuelcost level18 l2 l1)
(connected l2 l6)
(fuelcost level19 l2 l6)
(connected l3 l4)
(fuelcost level12 l3 l4)
(connected l3 l6)
(fuelcost level8 l3 l6)
(connected l4 l1)
(fuelcost level5 l4 l1)
(connected l4 l3)
(fuelcost level12 l4 l3)
(connected l4 l6)
(fuelcost level6 l4 l6)
(connected l4 l7)
(fuelcost level12 l4 l7)
(connected l5 l0)
(fuelcost level20 l5 l0)
(connected l5 l1)
(fuelcost level3 l5 l1)
(connected l5 l7)
(fuelcost level8 l5 l7)
(connected l6 l2)
(fuelcost level19 l6 l2)
(connected l6 l3)
(fuelcost level8 l6 l3)
(connected l6 l4)
(fuelcost level6 l6 l4)
(connected l6 l7)
(fuelcost level9 l6 l7)
(connected l7 l0)
(fuelcost level2 l7 l0)
(connected l7 l4)
(fuelcost level12 l7 l4)
(connected l7 l5)
(fuelcost level8 l7 l5)
(connected l7 l6)
(fuelcost level9 l7 l6)

(at t0 l4)
(fuel t0 level73)
(= (total-cost) 0)

(at p0 l2)
(at p1 l0)
(at p2 l4)
(at p3 l7)
)

(:goal
(and
(at p0 l4)
(at p1 l1)
(at p2 l7)
(at p3 l0)
)
)
(:metric minimize (total-cost)))

; plan
1. (load p2 t0 l4)
   deleted: (at p2 l4)
   added: (in p2 t0)
   goals met: 0 of 4
2. (drive t0 l4 l7 level61 level12 level73)
   deleted: (at t0 l4) (fuel t0 level73)
   added: (at t0 l7) (fuel t0 level61)
   goals met: 0 of 4
3. (unload p2 t0 l7)
   deleted: (in p2 t0)
   added: (at p2 l7)
   goals met: 1 of 4
4. (load p3 t0 l7)
   deleted: (at p3 l7)
   added: (in p3 t0)
   goals met: 1 of 4
5. (drive t0 l7 l0 level59 level2 level61)
   deleted: (at t0 l7) (fuel t0 level61)
   added: (at t0 l0) (fuel t0 level59)
   goals met: 1 of 4
6. (unload p3 t0 l0)
   deleted: (in p3 t0)
   added: (at p3 l0)
   goals met: 2 of 4
7. (load p1 t0 l0)
   deleted: (at p1 l0)
   added: (in p1 t0)
   goals met: 2 of 4
8. (drive t0 l0 l7 level57 level2 level59)
   deleted: (at t0 l0) (fuel t0 level59)
   added: (at t0 l7) (fuel t0 level57)
   goals met: 2 of 4
9. (drive t0 l7 l6 level48 level9 level57)
   deleted: (at t0 l7) (fuel t0 level57)
   added: (at t0 l6) (fuel t0 level48)
   goals met: 2 of 4
10. (drive t0 l6 l2 level29 level19 level48)
   deleted: (at t0 l6) (fuel t0 level48)
   added: (at t0 l2) (fuel t0 level29)
   goals met: 2 of 4
11. (load p0 t0 l2)
   deleted: (at p0 l2)
   added: (in p0 t0)
   goals met: 2 of 4
12. (drive t0 l2 l1 level11 level18 level29)
   deleted: (at t0 l2) (fuel t0 level29)
   added: (at t0 l1) (fuel t0 level11)
   goals met: 2 of 4
13. (unload p1 t0 l1)
   deleted: (in p1 t0)
   added: (at p1 l1)
   goals met: 3 of 4
14. (drive t0 l1 l4 level6 level5 level11)
   deleted: (at t0 l1) (fuel t0 level11)
   added: (at t0 l4) (fuel t0 level6)
   goals met: 3 of 4
15. (unload p0 t0 l4)
   deleted: (in p0 t0)
   added: (at p0 l4)
   goals met: 4 of 4
